{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "import urllib.parse        \n",
    "import requests\n",
    "from bs4 import BeautifulSoup\n",
    "import re\n",
    "\n",
    "import numpy as np\n",
    "from tqdm import tqdm_notebook\n",
    "from tqdm import tqdm\n",
    "\n",
    "import json\n",
    "\n",
    "from utils.structured_dynamic_index_utils_with_db import Aligner\n",
    "from utils.openai_utils import LLMTripletExtractor\n",
    "from utils.structured_inference_with_db import extract_triplets\n",
    "\n",
    "import pandas as pd\n",
    "import networkx as nx\n",
    "import plotly.graph_objects as go\n",
    "\n",
    "import warnings\n",
    "warnings.filterwarnings('ignore')\n",
    "\n",
    "from pymongo import MongoClient\n",
    "import os\n",
    "from dotenv import load_dotenv, find_dotenv\n",
    "\n",
    "from utils.structured_dynamic_index_utils_with_db import Aligner"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "# --- Mongo Setup ---\n",
    "_ = load_dotenv(find_dotenv())\n",
    "mongo_client = MongoClient(os.getenv(\"MONGO_URI\"))\n",
    "db = mongo_client.get_database(\"wikidata_ontology\")\n",
    "\n",
    "# --- Extractor Setup ---\n",
    "# extractor = LLMTripletExtractor(model='gpt-4.1-mini')\n",
    "aligner = Aligner(db)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_wiki_paragraphs_by_entity(entity_name):\n",
    "\n",
    "    url = f\"https://en.wikipedia.org/wiki/{entity_name}\"\n",
    "    response = requests.get(url)\n",
    "\n",
    "    soup = BeautifulSoup(response.content, 'html.parser')\n",
    "\n",
    "    title = soup.find(id=\"firstHeading\")\n",
    "\n",
    "    text_div = soup.find(\"div\", class_='mw-content-ltr mw-parser-output')\n",
    "\n",
    "    regex = re.compile('infobox.*')\n",
    "    last_marked = text_div.find(\"table\", {\"class\" : regex})\n",
    "\n",
    "    texts = []\n",
    "    last_marked = text_div.find(\"h2\")\n",
    "\n",
    "    for text in last_marked.find_all_previous('p'):\n",
    "        texts.append(text)\n",
    "\n",
    "    texts.reverse()\n",
    "    \n",
    "    text_metadata = []\n",
    "    for text in texts:\n",
    "        external_entities = []\n",
    "        for entity in text.find_all(\"a\"):\n",
    "            title = entity.get('title')\n",
    "            if title:\n",
    "                external_entities.append(title)\n",
    "        \n",
    "        content = text.text.strip()\n",
    "        if len(content) > 0:\n",
    "            text_metadata.append((content, external_entities))\n",
    "    \n",
    "    return text_metadata\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('Steven Paul Jobs (February 24, 1955 – October 5, 2011) was an American businessman, inventor, and investor best known for co-founding the technology company Apple Inc. Jobs was also the founder of NeXT and chairman and majority shareholder of Pixar. He was a pioneer of the personal computer revolution of the 1970s and 1980s, along with his early business partner and fellow Apple co-founder Steve Wozniak.',\n",
       "  ['Apple Inc.',\n",
       "   'NeXT',\n",
       "   'Pixar',\n",
       "   'Personal computer revolution',\n",
       "   'Steve Wozniak']),\n",
       " (\"Jobs was born in San Francisco in 1955 and adopted shortly afterwards. He attended Reed College in 1972 before withdrawing that same year. In 1974, he traveled through India, seeking enlightenment before later studying Zen Buddhism. He and Wozniak co-founded Apple in 1976 to further develop and sell Wozniak's Apple I personal computer. Together, the duo gained fame and wealth a year later with production and sale of the Apple II, one of the first highly successful mass-produced microcomputers.\",\n",
       "  ['Reed College',\n",
       "   'Hippie trail',\n",
       "   'Buddhism in the West',\n",
       "   'Apple I',\n",
       "   'Apple II',\n",
       "   'Microcomputer']),\n",
       " ('Jobs saw the commercial potential of the Xerox Alto in 1979, which was mouse-driven and had a graphical user interface (GUI). This led to the development of the largely unsuccessful Apple Lisa in 1983, followed by the breakthrough Macintosh in 1984, the first mass-produced computer with a GUI. The Macintosh launched the desktop publishing industry in 1985 (for example, the Aldus Pagemaker) with the addition of the Apple LaserWriter, the first laser printer to feature vector graphics and PostScript.',\n",
       "  ['Xerox Alto',\n",
       "   'Computer mouse',\n",
       "   'Graphical user interface',\n",
       "   'Apple Lisa',\n",
       "   'Macintosh 128K',\n",
       "   'Desktop publishing',\n",
       "   'Aldus Pagemaker',\n",
       "   'LaserWriter',\n",
       "   'Laser printer',\n",
       "   'Vector graphics',\n",
       "   'PostScript']),\n",
       " (\"In 1985, Jobs departed Apple after a long power struggle with the company's board and its then-CEO, John Sculley. That same year, Jobs took some Apple employees with him to found NeXT, a computer platform development company that specialized in computers for higher-education and business markets, serving as its CEO. In 1986, he bought the computer graphics division of Lucasfilm, which was spun off independently as Pixar.[3] Pixar produced the first computer-animated feature film, Toy Story (1995), and became a leading animation studio, producing dozens of commercially successful and critically acclaimed films.\",\n",
       "  ['John Sculley',\n",
       "   'Computer platform',\n",
       "   'Lucasfilm',\n",
       "   'Pixar',\n",
       "   'Computer-animated',\n",
       "   'Toy Story',\n",
       "   'Animation studio',\n",
       "   'List of Pixar films']),\n",
       " ('In 1997, Jobs returned to Apple as CEO after the company\\'s acquisition of NeXT. He was largely responsible for reviving Apple, which was on the verge of bankruptcy. He worked closely with British designer Jony Ive to develop a line of products and services that had larger cultural ramifications, beginning with the \"Think different\" advertising campaign, and leading to the iMac, iTunes, Mac OS X, Apple Store, iPod, iTunes Store, iPhone, App Store, and iPad. Jobs was also a board member at Gap Inc. from 1999 to 2002.[4] In 2003, Jobs was diagnosed with a pancreatic neuroendocrine tumor. He died of tumor-related respiratory arrest in 2011; in 2022, he was posthumously awarded the Presidential Medal of Freedom. Since his death, he has won 141 patents; Jobs holds over 450 patents in total.[5]',\n",
       "  ['Jony Ive',\n",
       "   'Think different',\n",
       "   'IMac',\n",
       "   'ITunes',\n",
       "   'Mac OS X',\n",
       "   'Apple Store',\n",
       "   'IPod',\n",
       "   'ITunes Store',\n",
       "   'IPhone',\n",
       "   'App Store (iOS)',\n",
       "   'IPad',\n",
       "   'Gap Inc.',\n",
       "   'Pancreatic neuroendocrine tumor',\n",
       "   'Respiratory arrest',\n",
       "   'Presidential Medal of Freedom'])]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "entity_name = \"Steve Jobs\"\n",
    "get_wiki_paragraphs_by_entity(entity_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Apple Inc.',\n",
       " 'NeXT',\n",
       " 'Pixar',\n",
       " 'Personal computer revolution',\n",
       " 'Steve Wozniak',\n",
       " 'Reed College',\n",
       " 'Hippie trail',\n",
       " 'Buddhism in the West',\n",
       " 'Apple I',\n",
       " 'Apple II',\n",
       " 'Microcomputer',\n",
       " 'Xerox Alto',\n",
       " 'Computer mouse',\n",
       " 'Graphical user interface',\n",
       " 'Apple Lisa',\n",
       " 'Macintosh 128K',\n",
       " 'Desktop publishing',\n",
       " 'Aldus Pagemaker',\n",
       " 'LaserWriter',\n",
       " 'Laser printer',\n",
       " 'Vector graphics',\n",
       " 'PostScript',\n",
       " 'John Sculley',\n",
       " 'Computer platform',\n",
       " 'Lucasfilm',\n",
       " 'Pixar',\n",
       " 'Computer-animated',\n",
       " 'Toy Story',\n",
       " 'Animation studio',\n",
       " 'List of Pixar films',\n",
       " 'Jony Ive',\n",
       " 'Think different',\n",
       " 'IMac',\n",
       " 'ITunes',\n",
       " 'Mac OS X',\n",
       " 'Apple Store',\n",
       " 'IPod',\n",
       " 'ITunes Store',\n",
       " 'IPhone',\n",
       " 'App Store (iOS)',\n",
       " 'IPad',\n",
       " 'Gap Inc.',\n",
       " 'Pancreatic neuroendocrine tumor',\n",
       " 'Respiratory arrest',\n",
       " 'Presidential Medal of Freedom']"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "texts_metadata = get_wiki_paragraphs_by_entity(entity_name)\n",
    "wiki_entities = []\n",
    "\n",
    "for text, metadata in texts_metadata:\n",
    "    wiki_entities.extend(metadata)\n",
    "wiki_entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"wiki_entities.json\", 'w') as f:\n",
    "    json.dump(wiki_entities, f)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Inference"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "model_name = 'gpt-4.1'\n",
    "extractor = LLMTripletExtractor(model=model_name)\n",
    "aligner = Aligner(db)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Refined triplets:  [{'subject': 'Steven Paul Jobs', 'relation': 'date of birth', 'object': 'February 24, 1955', 'subject_type': 'human', 'object_type': 'point in time', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'date of death', 'object': 'October 5, 2011', 'subject_type': 'human', 'object_type': 'point in time', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'country of citizenship', 'object': 'United States of America', 'subject_type': 'human', 'object_type': 'country', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'occupation', 'object': 'businessman', 'subject_type': 'human', 'object_type': 'profession', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'occupation', 'object': 'inventor', 'subject_type': 'human', 'object_type': 'profession', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'occupation', 'object': 'investor', 'subject_type': 'human', 'object_type': 'profession', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple Inc.', 'relation': 'founded by', 'object': 'Steven Paul Jobs', 'subject_type': 'company', 'object_type': 'human', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'NeXT', 'relation': 'founded by', 'object': 'Steven Paul Jobs', 'subject_type': 'company', 'object_type': 'human', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Pixar', 'relation': 'chairperson', 'object': 'Steven Paul Jobs', 'subject_type': 'company', 'object_type': 'human', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'owner of', 'object': 'Pixar', 'subject_type': 'human', 'object_type': 'company', 'qualifiers': [{'relation': 'shareholder type', 'object': 'majority shareholder'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'notable work', 'object': 'personal computer revolution', 'subject_type': 'human', 'object_type': 'event', 'qualifiers': [{'relation': 'point in time', 'object': '1970s'}, {'relation': 'point in time', 'object': '1980s'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'partner in business or sport', 'object': 'Steve Wozniak', 'subject_type': 'human', 'object_type': 'human', 'qualifiers': [{'relation': 'co-founder of', 'object': 'Apple Inc.'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}]\n",
      "Filtered triplets:  []\n",
      "Refined triplets:  [{'subject': 'Steven Paul Jobs', 'relation': 'place of birth', 'object': 'San Francisco', 'subject_type': 'human', 'object_type': 'city', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'date of birth', 'object': '1955', 'subject_type': 'human', 'object_type': 'point in time', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'practiced by', 'object': 'adoptive parents', 'subject_type': 'human', 'object_type': 'human', 'qualifiers': [{'relation': 'point in time', 'object': 'shortly after 1955'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'educated at', 'object': 'Reed College', 'subject_type': 'human', 'object_type': 'university', 'qualifiers': [{'relation': 'start time', 'object': '1972'}, {'relation': 'end time', 'object': '1972'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'participant in', 'object': 'India', 'subject_type': 'human', 'object_type': 'country', 'qualifiers': [{'relation': 'point in time', 'object': '1974'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'practiced by', 'object': 'Zen Buddhism', 'subject_type': 'human', 'object_type': 'religion', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steve Jobs', 'relation': 'founded by', 'object': 'Apple Inc.', 'subject_type': 'group of humans', 'object_type': 'company', 'qualifiers': [{'relation': 'point in time', 'object': '1976'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steve Wozniak', 'relation': 'founded by', 'object': 'Apple Inc.', 'subject_type': 'group of humans', 'object_type': 'company', 'qualifiers': [{'relation': 'point in time', 'object': '1976'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple Inc.', 'relation': 'discoverer or inventor', 'object': 'Apple I', 'subject_type': 'company', 'object_type': 'software', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple Inc.', 'relation': 'discoverer or inventor', 'object': 'Apple II', 'subject_type': 'company', 'object_type': 'software', 'qualifiers': [{'relation': 'point in time', 'object': '1977'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple II', 'relation': 'instance of', 'object': 'microcomputer', 'subject_type': 'computer', 'object_type': 'computer', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple II', 'relation': 'fabrication method', 'object': 'yes', 'subject_type': 'computer', 'object_type': 'query', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}]\n",
      "Filtered triplets:  []\n",
      "Refined triplets:  [{'subject': 'Steven Paul Jobs', 'relation': 'statement supported by', 'object': 'Xerox Alto', 'subject_type': 'human', 'object_type': 'computer', 'qualifiers': [{'relation': 'point in time', 'object': '1979'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Xerox Alto', 'relation': 'based on', 'object': 'computer mouse', 'subject_type': 'computer', 'object_type': 'input device', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Xerox Alto', 'relation': 'web interface software', 'object': 'graphical user interface', 'subject_type': 'computer', 'object_type': 'user interface', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple Lisa', 'relation': 'inspired by', 'object': 'Xerox Alto', 'subject_type': 'computer', 'object_type': 'computer', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple Lisa', 'relation': 'inception', 'object': '1983', 'subject_type': 'computer', 'object_type': 'point in time', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple Lisa', 'relation': 'has edition or translation', 'object': 'unsuccessful', 'subject_type': 'computer', 'object_type': 'qualitative property', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Macintosh 128K', 'relation': 'follows', 'object': 'Apple Lisa', 'subject_type': 'computer', 'object_type': 'computer', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Macintosh 128K', 'relation': 'inception', 'object': '1984', 'subject_type': 'computer', 'object_type': 'point in time', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Macintosh 128K', 'relation': 'web interface software', 'object': 'graphical user interface', 'subject_type': 'computer', 'object_type': 'user interface', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Macintosh 128K', 'relation': 'nature of statement', 'object': 'mass-produced', 'subject_type': 'computer', 'object_type': 'qualitative property', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Macintosh 128K', 'relation': 'agent of action', 'object': 'desktop publishing industry', 'subject_type': 'computer', 'object_type': 'industry', 'qualifiers': [{'relation': 'point in time', 'object': '1985'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Aldus PageMaker', 'relation': 'instance of', 'object': 'desktop publishing software', 'subject_type': 'software', 'object_type': 'software category', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple LaserWriter', 'relation': 'introduced in', 'object': 'Macintosh 128K', 'subject_type': 'printer', 'object_type': 'computer', 'qualifiers': [{'relation': 'point in time', 'object': '1985'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple LaserWriter', 'relation': 'instance of', 'object': 'laser printer', 'subject_type': 'printer', 'object_type': 'printer', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple LaserWriter', 'relation': 'has characteristic', 'object': 'vector graphics', 'subject_type': 'printer', 'object_type': 'print', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple LaserWriter', 'relation': 'has characteristic', 'object': 'PostScript', 'subject_type': 'printer', 'object_type': 'interface description language', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}]\n",
      "Filtered triplets:  []\n",
      "Refined triplets:  [{'subject': 'Apple Inc.', 'relation': 'employer', 'object': 'Steven Paul Jobs', 'subject_type': 'company', 'object_type': 'human', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'work period (end)', 'object': '1985', 'subject_type': 'human', 'object_type': 'point in time', 'qualifiers': [{'relation': 'employer', 'object': 'Apple'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'together with', 'object': 'John Sculley', 'subject_type': 'human', 'object_type': 'human', 'qualifiers': [{'relation': 'point in time', 'object': '1985'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'notable work', 'object': 'NeXT', 'subject_type': 'human', 'object_type': 'company', 'qualifiers': [{'relation': 'point in time', 'object': '1985'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'NeXT', 'relation': 'industry', 'object': 'computer platform development', 'subject_type': 'fictional company', 'object_type': 'industry', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'NeXT', 'relation': 'chief executive officer', 'object': 'Steven Paul Jobs', 'subject_type': 'fictional company', 'object_type': 'human', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'NeXT', 'relation': 'intended public', 'object': 'higher-education', 'subject_type': 'company', 'object_type': 'industry', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'NeXT', 'relation': 'intended public', 'object': 'business markets', 'subject_type': 'company', 'object_type': 'industry', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'owner of', 'object': 'Lucasfilm computer graphics division', 'subject_type': 'human', 'object_type': 'division', 'qualifiers': [{'relation': 'point in time', 'object': '1986'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Lucasfilm computer graphics division', 'relation': 'separated from', 'object': 'Pixar', 'subject_type': 'division', 'object_type': 'enterprise', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Pixar', 'relation': 'industry', 'object': 'animation studio', 'subject_type': 'fictional company', 'object_type': 'industry', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Pixar', 'relation': 'created for', 'object': 'Toy Story', 'subject_type': 'company', 'object_type': 'film', 'qualifiers': [{'relation': 'point in time', 'object': '1995'}, {'relation': 'genre', 'object': 'computer-animated feature film'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Pixar', 'relation': 'notable work', 'object': 'List of Pixar films', 'subject_type': 'company', 'object_type': 'film series', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}]\n",
      "Filtered triplets:  []\n",
      "Refined triplets:  [{'subject': 'Steven Paul Jobs', 'relation': 'position held', 'object': 'CEO of Apple', 'subject_type': 'human', 'object_type': 'title of authority', 'qualifiers': [{'relation': 'start time', 'object': '1997'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Apple Inc.', 'relation': 'afterward owned by', 'object': 'NeXT', 'subject_type': 'enterprise', 'object_type': 'enterprise', 'qualifiers': [{'relation': 'point in time', 'object': '1997'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'employer', 'object': 'Apple Inc.', 'subject_type': 'human', 'object_type': 'company', 'qualifiers': [{'relation': 'position held', 'object': 'CEO'}, {'relation': 'start time', 'object': '1997'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'partner in business or sport', 'object': 'Jony Ive', 'subject_type': 'human', 'object_type': 'human', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'developer', 'object': 'Think different', 'subject_type': 'human', 'object_type': 'advertising campaign', 'qualifiers': [{'relation': 'instance of', 'object': 'advertising campaign'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'discoverer or inventor', 'object': 'iMac', 'subject_type': 'human', 'object_type': 'software', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'developer', 'object': 'iTunes', 'subject_type': 'human', 'object_type': 'software', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'discoverer or inventor', 'object': 'iMac', 'subject_type': 'human', 'object_type': 'operating system', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'developer', 'object': 'Apple Store', 'subject_type': 'human', 'object_type': 'shop', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'iPod', 'relation': 'developer', 'object': 'Steven Paul Jobs', 'subject_type': 'electronic device', 'object_type': 'human', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'developer', 'object': 'iTunes', 'subject_type': 'human', 'object_type': 'online music store', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'discoverer or inventor', 'object': 'iPhone', 'subject_type': 'human', 'object_type': 'smartphone', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'developer', 'object': 'App Store (iOS)', 'subject_type': 'human', 'object_type': 'online service', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'discoverer or inventor', 'object': 'iPad', 'subject_type': 'human', 'object_type': 'tablet computer', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'member of', 'object': 'Gap Inc.', 'subject_type': 'human', 'object_type': 'company', 'qualifiers': [{'relation': 'start time', 'object': '1999'}, {'relation': 'end time', 'object': '2002'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'medical condition', 'object': 'pancreatic neuroendocrine tumor', 'subject_type': 'human', 'object_type': 'disease', 'qualifiers': [{'relation': 'point in time', 'object': '2003'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'cause of death', 'object': 'respiratory arrest', 'subject_type': 'human', 'object_type': 'disease', 'qualifiers': [{'relation': 'caused by', 'object': 'pancreatic neuroendocrine tumor'}, {'relation': 'point in time', 'object': '2011'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'award received', 'object': 'Presidential Medal of Freedom', 'subject_type': 'human', 'object_type': 'award', 'qualifiers': [{'relation': 'point in time', 'object': '2022'}, {'relation': 'posthumous', 'object': 'true'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'number of works', 'object': 'over 450', 'subject_type': 'human', 'object_type': 'quantity', 'qualifiers': [], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}, {'subject': 'Steven Paul Jobs', 'relation': 'number of works', 'object': '141', 'subject_type': 'human', 'object_type': 'quantity', 'qualifiers': [{'relation': 'since', 'object': '2011'}], 'source_text_id': 0, 'prompt_token_nums': 0, 'completion_token_num': 0, 'sample_id': 'wiki-texts'}]\n",
      "Filtered triplets:  []\n"
     ]
    }
   ],
   "source": [
    "entity_name = \"Steve Jobs\"\n",
    "jobs_paragraphs = get_wiki_paragraphs_by_entity(entity_name)\n",
    "\n",
    "for paragraph in jobs_paragraphs:\n",
    "    initial_triplets, refined_triplets, filtered_triplets = extract_triplets(paragraph, sample_id='wiki-texts', aligner=aligner, extractor=extractor)\n",
    "    print(\"Refined triplets: \", refined_triplets)\n",
    "    print(\"Filtered triplets: \", filtered_triplets)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "uri = \"neo4j://localhost:7688\"\n",
    "# username = \"neo4j\"\n",
    "# password = \"12345678\"\n",
    "# driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "driver = GraphDatabase.driver(uri)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('Alla', 'lives_with', 'Roman'), ('Alla', 'lives_with', 'Roman')]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def fetch_neo4j_triplets():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        MATCH (s)-[r]->(o)\n",
    "        RETURN s.name AS subject, type(r) AS predicate, o.name AS object\n",
    "        LIMIT 100\n",
    "        \"\"\"\n",
    "        result = session.run(query)\n",
    "        triplets = [(r[\"subject\"], r[\"predicate\"], r[\"object\"]) for r in result]\n",
    "    return triplets\n",
    "\n",
    "fetch_neo4j_triplets()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Any single node:\n",
      "<Node element_id='4:4500ff1a-3206-4fe1-9ee3-52b341586ea0:0' labels=frozenset({'Person'}) properties={'name': 'Alla'}>\n",
      "\n",
      "Collection of nodes:\n",
      "<Node element_id='4:4500ff1a-3206-4fe1-9ee3-52b341586ea0:0' labels=frozenset({'Person'}) properties={'name': 'Alla'}>\n",
      "<Node element_id='4:4500ff1a-3206-4fe1-9ee3-52b341586ea0:1' labels=frozenset({'Person'}) properties={'name': 'Alla'}>\n",
      "<Node element_id='4:4500ff1a-3206-4fe1-9ee3-52b341586ea0:2' labels=frozenset({'Person'}) properties={'name': 'Roman'}>\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_1664220/744417672.py:10: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n",
      "/tmp/ipykernel_1664220/744417672.py:11: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  any_node = session.read_transaction(find_any_node)\n",
      "/tmp/ipykernel_1664220/744417672.py:12: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  node_collection = session.read_transaction(find_some_nodes, 10)\n"
     ]
    }
   ],
   "source": [
    "\n",
    "def find_any_node(tx):\n",
    "    query = \"MATCH (n) RETURN n LIMIT 1\"\n",
    "    result = tx.run(query)\n",
    "    return result.single()[0] if result.peek() else None\n",
    "\n",
    "def find_some_nodes(tx, limit=5):\n",
    "    query = f\"MATCH (n) RETURN n LIMIT {limit}\"\n",
    "    return [record[\"n\"] for record in tx.run(query)]\n",
    "\n",
    "with driver.session() as session:\n",
    "    any_node = session.read_transaction(find_any_node)\n",
    "    node_collection = session.read_transaction(find_some_nodes, 10)\n",
    "\n",
    "    print(\"Any single node:\")\n",
    "    print(any_node)\n",
    "\n",
    "    print(\"\\nCollection of nodes:\")\n",
    "    for node in node_collection:\n",
    "        print(node)\n",
    "\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_some_nodes(tx, limit=5):\n",
    "    query = f\"MATCH (n) RETURN n LIMIT {limit}\"\n",
    "    return [record[\"n\"] for record in tx.run(query)]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_1091987/3946427599.py:4: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n",
      "/tmp/ipykernel_1091987/3946427599.py:5: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  session.write_transaction(add_node, \"Alla\")\n"
     ]
    }
   ],
   "source": [
    "def add_node(tx, name):\n",
    "    tx.run(\"CREATE (n:Person {name: $name})\", name=name)\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.write_transaction(add_node, \"Alla\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_1664220/4046672432.py:8: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n"
     ]
    }
   ],
   "source": [
    "def get_triples(tx):\n",
    "    tx.run(f\"\"\"\n",
    "            MATCH (a)-[r]->(b)\n",
    "            RETURN a, r, b\n",
    "            \"\"\")\n",
    "    \n",
    "\n",
    "with driver.session() as session:\n",
    "    print(session.execute_read(get_triples))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_1700293/18095691.py:10: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  session.write_transaction(add_relation, \"DevOps\", \"Practice\", \"is\")\n"
     ]
    }
   ],
   "source": [
    "def add_relation(tx, head, tail, relation):\n",
    "    query = f\"\"\"\n",
    "        MATCH (a {{name: $head}}), (b {{name: $tail}})\n",
    "        CREATE (a)-[r:{relation}]->(b)\n",
    "        RETURN type(r)\n",
    "        \"\"\"\n",
    "    result = tx.run(query, head=head, tail=tail)\n",
    "\n",
    "with driver.session() as session:        \n",
    "    session.write_transaction(add_relation, \"DevOps\", \"Practice\", \"is\")\n",
    "    # session.write_transaction(add_node, \"Practice\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_node(tx, node_name):\n",
    "    tx.run(\"CREATE (n:Node {name: $node_name})\", node_name=node_name)\n",
    "\n",
    "def add_relation(tx, head, tail, relation):\n",
    "    query = f\"\"\"\n",
    "        MATCH (a {{name: $head}}), (b {{name: $tail}})\n",
    "        CREATE (a)-[r:{relation}]->(b)\n",
    "        RETURN type(r)\n",
    "        \"\"\"\n",
    "    result = tx.run(query, head=head, tail=tail)\n",
    "\n",
    "def get_node(tx, name):\n",
    "    result = tx.run(\"MATCH (n:Node {name: $name}) RETURN n.name AS name\", name=name)\n",
    "    return [record[\"name\"] for record in result]\n",
    "\n",
    "\n",
    "# for i, row in full_df.iterrows():\n",
    "#     head = row['subject']\n",
    "#     tail = row['object']\n",
    "#     relation = \"_\".join(row['relation'].replace(\"-\", \"\").replace(\".\", \"\").split())\n",
    "#     # print(head, tail, relation)\n",
    "#     with driver.session() as session:\n",
    "#         if not session.read_transaction(get_node, head):\n",
    "#             session.write_transaction(add_node, head)\n",
    "\n",
    "#         if not session.read_transaction(get_node, tail):\n",
    "#             session.write_transaction(add_node, tail)\n",
    "            \n",
    "#         session.write_transaction(add_relation, head, tail, relation)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_683353/1323360862.py:8: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  names = session.read_transaction(get_person)\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_person(tx):\n",
    "    \n",
    "    result = tx.run(\"MATCH (subject:Node {name: $name1}) -[r:RELATION]-> (object:Node {name: $name2}) RETURN r.name as relation\", name1=\"Steven Paul Jobs\", name2=\"Next\")\n",
    "    \n",
    "    return [rel[\"relation\"] for rel in result]\n",
    "\n",
    "with driver.session() as session:\n",
    "    names = session.read_transaction(get_person)\n",
    "\n",
    "names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_705238/3144383912.py:8: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  names = session.write_transaction(delete_all)\n"
     ]
    }
   ],
   "source": [
    "def delete_all(tx):\n",
    "    \n",
    "    result = tx.run(\"MATCH (n) OPTIONAL MATCH (n)-[r]-() DELETE r, n\")\n",
    "    \n",
    "    return result\n",
    "\n",
    "with driver.session() as session:\n",
    "    names = session.write_transaction(delete_all)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Post-analysis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>relation</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Steven Paul Jobs</td>\n",
       "      <td>date of birth</td>\n",
       "      <td>February 24, 1955</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Steven Paul Jobs</td>\n",
       "      <td>date of death</td>\n",
       "      <td>October 5, 2011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Steven Paul Jobs</td>\n",
       "      <td>country of citizenship</td>\n",
       "      <td>United States of America</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Steven Paul Jobs</td>\n",
       "      <td>occupation</td>\n",
       "      <td>Businessman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Steven Paul Jobs</td>\n",
       "      <td>occupation</td>\n",
       "      <td>Inventor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>several other businesses and philanthropic ven...</td>\n",
       "      <td>specialized in</td>\n",
       "      <td>Microprocessor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>several other businesses and philanthropic ven...</td>\n",
       "      <td>specialized in</td>\n",
       "      <td>technology and pop culture conventions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>several other businesses and philanthropic ven...</td>\n",
       "      <td>specialized in</td>\n",
       "      <td>technology in K–12 schools</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>several other businesses and philanthropic ven...</td>\n",
       "      <td>specialized in</td>\n",
       "      <td>environmental practices</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>several other businesses and philanthropic ven...</td>\n",
       "      <td>specialized in</td>\n",
       "      <td>satellites</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>291 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              subject                relation  \\\n",
       "0                                    Steven Paul Jobs           date of birth   \n",
       "1                                    Steven Paul Jobs           date of death   \n",
       "2                                    Steven Paul Jobs  country of citizenship   \n",
       "3                                    Steven Paul Jobs              occupation   \n",
       "4                                    Steven Paul Jobs              occupation   \n",
       "..                                                ...                     ...   \n",
       "42  several other businesses and philanthropic ven...          specialized in   \n",
       "43  several other businesses and philanthropic ven...          specialized in   \n",
       "44  several other businesses and philanthropic ven...          specialized in   \n",
       "45  several other businesses and philanthropic ven...          specialized in   \n",
       "46  several other businesses and philanthropic ven...          specialized in   \n",
       "\n",
       "                                    object  \n",
       "0                        February 24, 1955  \n",
       "1                          October 5, 2011  \n",
       "2                 United States of America  \n",
       "3                              Businessman  \n",
       "4                                 Inventor  \n",
       "..                                     ...  \n",
       "42                          Microprocessor  \n",
       "43  technology and pop culture conventions  \n",
       "44              technology in K–12 schools  \n",
       "45                 environmental practices  \n",
       "46                              satellites  \n",
       "\n",
       "[291 rows x 3 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "from collections import defaultdict\n",
    "\n",
    "df = pd.read_csv('full_triplets.csv', index_col=0)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_instance_of = df[df['relation'] == 'instance of']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['specialized in', 'notable work', 'inception']"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[(df['subject'] == 'Apple II') & (df['relation'] != 'instance of')].relation.to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "relation2head = defaultdict(set)\n",
    "relation2tail = defaultdict(set)\n",
    "\n",
    "for i, row in df_instance_of.iterrows():\n",
    "    relations = df[(df['subject'] == row['subject']) & (df['relation'] != 'instance of')].relation.to_list()\n",
    "    \n",
    "    for rel in relations:\n",
    "        relation2head[rel].add(row['object'])\n",
    "\n",
    "    relations = df[(df['object'] == row['subject']) & (df['relation'] != 'instance of')].relation.to_list()\n",
    "    \n",
    "    for rel in relations:\n",
    "        relation2tail[rel].add(row['object'])\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "defaultdict(set,\n",
       "            {'notable work': {'3D computer-animated feature film',\n",
       "              'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'desk lamp',\n",
       "              'market capitalization',\n",
       "              'microcomputer'},\n",
       "             'developed': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'RenderMan',\n",
       "              'Software',\n",
       "              'microcomputer',\n",
       "              'video game'},\n",
       "             'saw the commercial potential of': {'Graphical user interface',\n",
       "              'Mouse',\n",
       "              'microcomputer'},\n",
       "             'inception': {'Graphical user interface',\n",
       "              'advertising campaign',\n",
       "              'microcomputer'},\n",
       "             'has part': {'Graphical user interface', 'microcomputer'},\n",
       "             'influenced': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Graphical user interface',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization',\n",
       "              'microcomputer'},\n",
       "             'succeeded': {'Graphical user interface', 'microcomputer'},\n",
       "             'founder of': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization'},\n",
       "             'acquired': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Software',\n",
       "              'Technology company'},\n",
       "             'specialized in': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization'},\n",
       "             'occupation': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization'},\n",
       "             'spun off as': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'funded': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm'},\n",
       "             'majority shareholder of': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm'},\n",
       "             'mascot of': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm'},\n",
       "             'developer': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'departed from': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'returned to': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'participant': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'}})"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relation2tail"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "defaultdict(set,\n",
       "            {'specialized in': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization',\n",
       "              'microcomputer'},\n",
       "             'notable work': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization',\n",
       "              'microcomputer'},\n",
       "             'inception': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Graphical user interface',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization',\n",
       "              'microcomputer'},\n",
       "             'point in time': {'3D computer-animated feature film',\n",
       "              'Graphical user interface',\n",
       "              'microcomputer'},\n",
       "             'developer': {'Graphical user interface',\n",
       "              'Laser printer',\n",
       "              'microcomputer'},\n",
       "             'influenced': {'Graphical user interface', 'microcomputer'},\n",
       "             'has part': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Graphical user interface',\n",
       "              'Laser printer',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization',\n",
       "              'microcomputer'},\n",
       "             'country of citizenship': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization'},\n",
       "             'headquarters location': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'Technology company',\n",
       "              'market capitalization'},\n",
       "             'number of units sold': {'Software',\n",
       "              'Technology company',\n",
       "              'microcomputer'},\n",
       "             'business partner': {'Software', 'Technology company'},\n",
       "             'developed': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'RenderMan',\n",
       "              'Software',\n",
       "              'Technology company'},\n",
       "             'departed from': {'Software', 'Technology company'},\n",
       "             'founder of': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'acquired': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'division of': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm'},\n",
       "             'spun off as': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm'},\n",
       "             'revenue': {'Animation studio',\n",
       "              'Apple Inc.',\n",
       "              'Computer graphics division of Lucasfilm',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'award received': {'Animation studio',\n",
       "              'Computer graphics division of Lucasfilm'},\n",
       "             'state': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'lost market share to': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'largest manufacturing company by': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'largest vendor of': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'market capitalization': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'has': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'received criticism regarding': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'Software',\n",
       "              'market capitalization'},\n",
       "             'cost': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization',\n",
       "              'microcomputer'},\n",
       "             'shares issued': {'Apple Inc.',\n",
       "              'Computers for higher-education and business markets',\n",
       "              'Multinational corporation',\n",
       "              \"One of the world's most valuable brands\",\n",
       "              'market capitalization'},\n",
       "             'hosted on': {'Software'},\n",
       "             'combined with': {'Software'},\n",
       "             'mascot of': {'desk lamp'}})"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relation2head"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>relation</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Apple II</td>\n",
       "      <td>instance of</td>\n",
       "      <td>microcomputer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Xerox Alto</td>\n",
       "      <td>instance of</td>\n",
       "      <td>microcomputer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Xerox Alto</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Mouse</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Xerox Alto</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Graphical user interface</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Apple Lisa</td>\n",
       "      <td>instance of</td>\n",
       "      <td>microcomputer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Macintosh</td>\n",
       "      <td>instance of</td>\n",
       "      <td>microcomputer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Macintosh</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Graphical user interface</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Aldus Pagemaker</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Software</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Apple LaserWriter</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Laser printer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>NeXT</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Software</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>Toy Story</td>\n",
       "      <td>instance of</td>\n",
       "      <td>3D computer-animated feature film</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>Pixar</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Animation studio</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>Think different</td>\n",
       "      <td>instance of</td>\n",
       "      <td>advertising campaign</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Apple Inc.</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Multinational corporation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Apple Inc.</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Apple Inc.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Apple I</td>\n",
       "      <td>instance of</td>\n",
       "      <td>microcomputer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Lisa</td>\n",
       "      <td>instance of</td>\n",
       "      <td>microcomputer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Lisa</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Graphical user interface</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>Apple Inc.</td>\n",
       "      <td>instance of</td>\n",
       "      <td>One of the world's most valuable brands</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>Apple Inc.</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Computers for higher-education and business ma...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Apple Inc.</td>\n",
       "      <td>instance of</td>\n",
       "      <td>market capitalization</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>NeXT</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Technology company</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>OpenStep</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Software</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>OPENSTEP for Mach</td>\n",
       "      <td>instance of</td>\n",
       "      <td>OpenStep</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>WebObjects</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Software</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Doom</td>\n",
       "      <td>instance of</td>\n",
       "      <td>video game</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Quake</td>\n",
       "      <td>instance of</td>\n",
       "      <td>video game</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Pixar</td>\n",
       "      <td>instance of</td>\n",
       "      <td>Computer graphics division of Lucasfilm</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>RenderMan</td>\n",
       "      <td>instance of</td>\n",
       "      <td>RenderMan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Luxo Jr.</td>\n",
       "      <td>instance of</td>\n",
       "      <td>desk lamp</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Personal computer</td>\n",
       "      <td>instance of</td>\n",
       "      <td>microcomputer</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              subject     relation  \\\n",
       "26           Apple II  instance of   \n",
       "29         Xerox Alto  instance of   \n",
       "30         Xerox Alto  instance of   \n",
       "31         Xerox Alto  instance of   \n",
       "33         Apple Lisa  instance of   \n",
       "36          Macintosh  instance of   \n",
       "38          Macintosh  instance of   \n",
       "42    Aldus Pagemaker  instance of   \n",
       "43  Apple LaserWriter  instance of   \n",
       "50               NeXT  instance of   \n",
       "55          Toy Story  instance of   \n",
       "56              Pixar  instance of   \n",
       "68    Think different  instance of   \n",
       "0          Apple Inc.  instance of   \n",
       "14         Apple Inc.  instance of   \n",
       "16            Apple I  instance of   \n",
       "22               Lisa  instance of   \n",
       "24               Lisa  instance of   \n",
       "59         Apple Inc.  instance of   \n",
       "61         Apple Inc.  instance of   \n",
       "64         Apple Inc.  instance of   \n",
       "0                NeXT  instance of   \n",
       "20           OpenStep  instance of   \n",
       "25  OPENSTEP for Mach  instance of   \n",
       "27         WebObjects  instance of   \n",
       "43               Doom  instance of   \n",
       "44              Quake  instance of   \n",
       "10              Pixar  instance of   \n",
       "23          RenderMan  instance of   \n",
       "25           Luxo Jr.  instance of   \n",
       "0   Personal computer  instance of   \n",
       "\n",
       "                                               object  \n",
       "26                                      microcomputer  \n",
       "29                                      microcomputer  \n",
       "30                                              Mouse  \n",
       "31                           Graphical user interface  \n",
       "33                                      microcomputer  \n",
       "36                                      microcomputer  \n",
       "38                           Graphical user interface  \n",
       "42                                           Software  \n",
       "43                                      Laser printer  \n",
       "50                                           Software  \n",
       "55                  3D computer-animated feature film  \n",
       "56                                   Animation studio  \n",
       "68                               advertising campaign  \n",
       "0                           Multinational corporation  \n",
       "14                                         Apple Inc.  \n",
       "16                                      microcomputer  \n",
       "22                                      microcomputer  \n",
       "24                           Graphical user interface  \n",
       "59            One of the world's most valuable brands  \n",
       "61  Computers for higher-education and business ma...  \n",
       "64                              market capitalization  \n",
       "0                                  Technology company  \n",
       "20                                           Software  \n",
       "25                                           OpenStep  \n",
       "27                                           Software  \n",
       "43                                         video game  \n",
       "44                                         video game  \n",
       "10            Computer graphics division of Lucasfilm  \n",
       "23                                          RenderMan  \n",
       "25                                          desk lamp  \n",
       "0                                       microcomputer  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_instance_of"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
